{"meta":{"title":"Simply Jane's Territory","subtitle":null,"description":null,"author":"Jing","url":"https://baifamonv.github.io"},"pages":[{"title":"Art","date":"2016-07-26T21:57:10.000Z","updated":"2016-07-26T22:04:44.721Z","comments":true,"path":"Art/Art.html","permalink":"https://baifamonv.github.io/Art/Art.html","excerpt":"","text":"Well, I guess I am weird Chinese Dance and BaladiTraditional CookingFloral ArtKungfu Tea"},{"title":" Tool I am using ","date":"2016-07-27T23:41:26.000Z","updated":"2016-07-29T15:18:38.996Z","comments":true,"path":"Tools/Tools.html","permalink":"https://baifamonv.github.io/Tools/Tools.html","excerpt":"","text":"GitHexo with HaroopadVisual StudioAndroid Studio with Genymotion and Gradle Daemonnpmrnpm:React Native Package Manager built to ease your daily React Native development12$ npm install react-native-module --save$ rnpm link react-native-module equal to1$ rnpm install react-native-module ChocolateyeclipseLaravelExponent Exponent is a mobile app development tool that enables you to build high quality native iOS and Android applications using JavaScript and deploy them effortlessly.Writing an Exponent app is like writing a React Native app, except you never need to open Xcode / Android Studio, or write any native code. The Exponent SDK provides access to system functionality such as contacts, camera and social login"}],"posts":[{"title":"Webpack for react","slug":"react","date":"2016-08-10T21:53:15.000Z","updated":"2016-08-10T22:20:43.118Z","comments":true,"path":"2016/08/10/react/","link":"","permalink":"https://baifamonv.github.io/2016/08/10/react/","excerpt":"","text":"Install node.jsInstall webpack globallycd to root and type the following command1npm install webpack -g Install webpack for each projectcreate a package.json filecd to your project and type the following command1npm init add webpack to the package.json1npm install webpack --save-dev add webpack.config.js1touch webpack.config.js Paste the basic code from the filefile detailshttps://www.youtube.com/watch?annotation_id=annotation_4139363737&amp;feature=iv&amp;src_vid=MhkGQAoc7bc&amp;v=9kJVYpOqcVU","categories":[],"tags":[{"name":"react","slug":"react","permalink":"https://baifamonv.github.io/tags/react/"},{"name":"node","slug":"node","permalink":"https://baifamonv.github.io/tags/node/"},{"name":"webpack","slug":"webpack","permalink":"https://baifamonv.github.io/tags/webpack/"}]},{"title":"react-native-maps'","slug":"react-native-maps","date":"2016-07-29T00:32:47.000Z","updated":"2016-07-29T17:06:48.811Z","comments":true,"path":"2016/07/28/react-native-maps/","link":"","permalink":"https://baifamonv.github.io/2016/07/28/react-native-maps/","excerpt":"","text":"Install react-native-mapsInstall react-native-maps official siteyou could choose the above one or mine to install react-native-maps Run “android” and make sure every packages is updated. I am using genymotion so I need to do some install before install google play: Install ARM Translation,download Genymotion-ARM-Translation_v1.1zip,then drag and drop the downloaded file to an opened Genymotion virtual device. After file transfering is done, there will be a confirmation dialog ,just click OK all the way. You need to reboot the virtual device now but we don’t suggest to just close the virtual device and relaunch it once again since it may leads to some weird behaviour.. First we need to reboot the device. cd C:\\Users[yourUserName]\\AppData\\Local\\Android\\sdk\\platform-tools1adb reboot Now close the device and restart it againIn case you accidentally close the virtual device, don’t be panic. You might need to relaunch for a few times before it can boot up. Install gapps. download the flashable zip of gapps by your virtual device’s Android version:Android 5.0.x, Android 4.4.x, Android 4.3.x, Android 4.2.x, Android 4.1.x, Android 4.0.x, Android 2.3.3 and thendrag and drop the downloaded file to the virtual device and like before reboot the device. “Google Play services has stopped” will keep popping. don’t worry. just go to google play and update all apps. Install the following packages in android SDK manager : Extras / Google Play services Extras / Google Repository Android 6.0 (API 23) / Google APIs Intel x86 Atom System Image Rev. 13 Generate your SHA1 key cd C:\\Program Files\\Java\\jdk1.8.0_77\\bin where your keytool.exe exsit type 1keytool -list -v -keystore &quot;%USERPROFILE%\\.android\\debug.keystore&quot; -alias androiddebugkey -storepass android -keypass android , to show the key: type 1keytool -list -keystore my-release-key.keystore. it would be like this “D8:AA:43:97:59:EE:C5:95:26:6A:07:EE:1C:37:8E:F4:F0:C8:05:C8” find your packname from file C:\\Users[yourusername]\\AwesomeProject\\android\\app\\src\\main\\AndroidManifest.xml Go to Google API Console and select your project, or create one.Create a new key by clicking on Create credentials -&gt; API Key -&gt; Android Key,enter the name of the API key and your SHA1 key and create it. Then we get android API key Manual install in your file build.gradle add: dependencies { ... compile 'com.airbnb.android:react-native-maps:0.7.1' } Add your API key to your manifest file: For React Native v0.29.0 or above:in your application object which located C:\\Users[username]\\getAwesome\\android\\app\\src\\main\\java\\com[projectName], add: public class MyApplication extends Application implements ReactApplication { private final ReactNativeHost reactNativeHost = new ReactNativeHost(this) { @Override protected List getPackages() { return Arrays.asList( new MainReactPackage(), new MapsPackage()); } }; @Override public ReactNativeHost getReactNativeHost() { return reactNativeHost; } } problems: FAILURE: Build failed with an exception.What went wrong:A problem occurred configuring project ‘:app’.Cannot evaluate module react-native-maps : Configuration with name ‘default’ not found. Solution: edit file C:\\Users[yourUsername]]\\AwesomeProject\\android\\settings.gradle change to include ‘:react-native-maps:lib’project(‘:react-native-maps’).projectDir = new File(rootProject.projectDir, ‘../node_modules/react-native-maps/android/lib’)","categories":[],"tags":[{"name":"Install react-native-maps","slug":"Install-react-native-maps","permalink":"https://baifamonv.github.io/tags/Install-react-native-maps/"}]},{"title":"what make React Native special?","slug":"native","date":"2016-07-28T15:29:37.000Z","updated":"2016-07-29T15:23:45.753Z","comments":true,"path":"2016/07/28/native/","link":"","permalink":"https://baifamonv.github.io/2016/07/28/native/","excerpt":"","text":"what make React Native special?“The idea of React Native meant we could bring all the things we loved about developing for the web — such as fast iterations and having a single team build the whole product — to mobile. It meant we could move faster”At the same time“..to ship the first fully React Native-powered app where the user experience was identical to an app built in Objective-C”“..having to build the same app separately for each platform is a problem in the industry” Martin Konicekcode.facebook.com/posts/597378980427792/react-native-a-year-in-review React Native has rapid adoption and vibe community and release almost every two weeks. ‘..code was downloaded about 70,000 times from npm in March 2016’. Popular applications like airbNb and qq are created uing React Native. Beyond apps, there is a wide variety of services that build upon or complement React Native.Exponent lets you build and share React Native apps without having to compile anything; React Native Playground lets you edit and run React Native apps in the browser; AppHub and Microsoft CodePush let you deploy code instantly without going through the app stores; JS.coach is a database of third-party modules; and Deco is an IDE for React Native. Good resources: [Building the F8 2016 App Tutorial] (http://makeitopen.com/tutorials/building-the-f8-app/planning/) Git Repo","categories":[],"tags":[{"name":"React Native","slug":"React-Native","permalink":"https://baifamonv.github.io/tags/React-Native/"}]},{"title":"React Native Install Windows + Android","slug":"Android","date":"2016-07-27T23:59:19.000Z","updated":"2016-07-29T00:34:44.157Z","comments":true,"path":"2016/07/27/Android/","link":"","permalink":"https://baifamonv.github.io/2016/07/27/Android/","excerpt":"","text":"React Native Install Windows + AndroidDependencies for Windows + AndroidWell, I only have window pc on my hand. Ideally I would like to use Mac with android and ios install.Anyway while I am waiting for android tool to download, I would like to share some my experience of install React Native. Node.js: Could be installed by Chocolatey1choco install nodejs.install Genymotion: Also need to install virtual machine androidstudio Testing your React Native Installation install the React Native command line interface1npm install -g react-native-cli initialize the project1react-native init AwesomeProject Create a new project in android studio, copy local.properties file from new project folder to android foler in AwesomeProject. (This process is vital which took me a lot of timi to figure out) Testing and problem-solution:firstly, you need to start Genymotion virtual machine 12cd AwesomeProjectreact-native run-android failed to find build tools revision 23.0.0The error massage would indicate what version of android sdk you should install.you could go to SDK manager and click ‘Launch Standalone SDK manger’ and choose the tool you should install Execution failed for task ‘:app:compileDebugJavaWithJavac’Could not find tools.jarsolution: Setting the JAVA_HOME variable to C:\\Program Files\\Java\\jdkX.XXhow: 1) go to Search bar and type in “environment” and click on “Edit the system environment variables”. 2) click on “Environment Variables” button 3) under System Variables heading, click “new”. Enter the name as JAVA_HOME and look up the path to the jdk.. Click OK and OK again. 4) close your DOS window and open a new one com.android.builder.testing.api.DeviceException: No connected devices! start Genymotion virtual machine would solve the problem com.android.builder.testing.api.DeviceException: Timeout getting device list. In Genymotion, go to Settings &gt; ADB (tab), Select radio option “Use custom Android SDK tools” and add the path to your local Android SDK Don’t forget to restart your emulator after you did the changes! Warning:Gradle version 2.10 is required. Current version is 2.8. If using the gradle wrapper, try editing the distributionUrl in C:\\Users\\blahblah\\myproject\\gradle\\wrapper\\gradle-wrapper.properties to gradle-2.10-all.zip solution: open file Project\\gradle\\wrapper\\gradle-wrapper.properties and edit field distributionUrl like this distributionUrl=https\\://services.gradle.org/distributions/gradle-2.10-all.zipalso you have to be sure you already have gradle 2.10 installed In the new opened command window , “ERROR EPERM: operation not permitted, lstat….” Solution:just open node.js command by administration mouhhaaaa, It works! In the future open node.js command by administration! cd AwesomeProject make sure the following is running: Genymotion virtual machine , react-native run-android","categories":[],"tags":[{"name":"react native","slug":"react-native","permalink":"https://baifamonv.github.io/tags/react-native/"},{"name":"android studio","slug":"android-studio","permalink":"https://baifamonv.github.io/tags/android-studio/"}]},{"title":"command-for-hexo","slug":"command-for-hexo","date":"2016-07-27T23:10:29.000Z","updated":"2016-07-29T01:16:31.899Z","comments":true,"path":"2016/07/27/command-for-hexo/","link":"","permalink":"https://baifamonv.github.io/2016/07/27/command-for-hexo/","excerpt":"","text":"create new post12hexo new post &apos;install react-native-maps&apos; create new page1hexo new page &apos;Toolhex generate1hexo g check local web1hexo s deploy website1hexo d If certain content is causing processing issues in your posts, wrap it with the raw tag to avoid rendering errors. content highlight code quote1alert(&apos;Hello World!&apos;); 1[rectangle setX: 10 y: 10 width: 20 height: 20]; _.compactUnderscore.js12_.compact([0, 1, false, 2, &apos;&apos;, 3]);=&gt; [1, 2, 3] Array.map1array.map(callback[, thisArg])","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://baifamonv.github.io/tags/hexo/"}]},{"title":"About Me","slug":"about-me","date":"2016-07-26T13:55:00.000Z","updated":"2016-07-26T21:52:59.900Z","comments":true,"path":"2016/07/26/about-me/","link":"","permalink":"https://baifamonv.github.io/2016/07/26/about-me/","excerpt":"","text":"My Very fist PostI have never tried markdown before and it’s amazingly simple. I love it! A little about me My name is Jing Chen and I am about to start my fourth year of computer science at Concordia University. I love dancing and could be very addicted to read Chinese novels. I love web application. Right now I am learning and practing developing web application by laravel/homestead, git, wordpress, forge and digital ocean.Now I could confidently automate the process of local test-git version control and server update. Also it’s my first github page powered by Hexo and theme by PPOffice. I guess I would stay here long time and share my experice. Most of important of all, I am learning Active.js which is amazing library.","categories":[],"tags":[{"name":"markdown","slug":"markdown","permalink":"https://baifamonv.github.io/tags/markdown/"}]}]}