{"meta":{"title":"Simply Jane's Territory","subtitle":null,"description":null,"author":"Jing","url":"https://baifamonv.github.io"},"pages":[{"title":"Art","date":"2016-07-26T21:57:10.000Z","updated":"2016-07-26T22:04:44.721Z","comments":true,"path":"Art/index.html","permalink":"https://baifamonv.github.io/Art/index.html","excerpt":"","text":"Well, I guess I am weird Chinese Dance and BaladiTraditional CookingFloral ArtKungfu Tea"},{"title":"'Tools'","date":"2016-07-27T23:41:26.000Z","updated":"2016-07-27T23:41:26.676Z","comments":true,"path":"Tools/index.html","permalink":"https://baifamonv.github.io/Tools/index.html","excerpt":"","text":""}],"posts":[{"title":"React Native Install Windows + Android","slug":"Android","date":"2016-07-27T23:59:19.000Z","updated":"2016-07-28T00:22:57.134Z","comments":true,"path":"2016/07/27/Android/","link":"","permalink":"https://baifamonv.github.io/2016/07/27/Android/","excerpt":"","text":"React Native Install Windows + AndroidDependencies for Windows + AndroidWell, I only have window pc on my hand. Ideally I would like to use Mac with android and ios install.Anyway while I am waiting for android tool to download, I would like to share some my experience of install React Native. Node.js: Could be installed by Chocolateychoco install nodejs.install Genymotion: Also need to install virtual machine androidstudio Testing your React Native Installation install the React Native command line interfacenpm install -g react-native-cli initialize the projectreact-native init AwesomeProject Create a new project in android studio, copy local.properties file from new project folder to android foler in AwesomeProject. (This process is vital which took me a lot of timi to figure out) Testing and problem-solution:firstly, you need to start genymotion simulator cd AwesomeProject react-native run-android failed to find build tools revision 23.0.0The error massage would indicate what version of android sdk you should install.you could go to SDK manager and click ‘Launch Standalone SDK manger’ and choose the tool you should install Execution failed for task ‘:app:compileDebugJavaWithJavac’Could not find tools.jarsolution: Setting the JAVA_HOME variable to C:\\Program Files\\Java\\jdkX.XXhow: 1) go to Search bar and type in “environment” and click on “Edit the system environment variables”. 2) click on “Environment Variables” button 3) under System Variables heading, click “new”. Enter the name as JAVA_HOME and look up the path to the jdk.. Click OK and OK again. 4) close your DOS window and open a new one com.android.builder.testing.api.DeviceException: No connected devices! start genymotion simulator would solve the problem com.android.builder.testing.api.DeviceException: Timeout getting device list.In Genymotion, go to Settings &gt; ADB (tab), Select radio option “Use custom Android SDK tools” and add the path to your local Android SDK Don’t forget to restart your emulator after you did the changes! mouhhaaaa, It works! In the future cd AwesomeProject react-native run-android","categories":[],"tags":[{"name":"react native","slug":"react-native","permalink":"https://baifamonv.github.io/tags/react-native/"},{"name":"android studio","slug":"android-studio","permalink":"https://baifamonv.github.io/tags/android-studio/"}]},{"title":"command-for-hexo","slug":"command-for-hexo","date":"2016-07-27T23:10:29.000Z","updated":"2016-07-28T00:26:20.458Z","comments":true,"path":"2016/07/27/command-for-hexo/","link":"","permalink":"https://baifamonv.github.io/2016/07/27/command-for-hexo/","excerpt":"","text":"create new posthexo new &apos;My vey first post&apos; create new pagehexo new page &apos;Toolhexo&apos; generatehexo g check local webhexo s deploy websitehexo d","categories":[],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://baifamonv.github.io/tags/hexo/"}]},{"title":"About Me","slug":"about-me","date":"2016-07-26T13:55:00.000Z","updated":"2016-07-26T21:52:59.900Z","comments":true,"path":"2016/07/26/about-me/","link":"","permalink":"https://baifamonv.github.io/2016/07/26/about-me/","excerpt":"","text":"My Very fist PostI have never tried markdown before and it’s amazingly simple. I love it! A little about me My name is Jing Chen and I am about to start my fourth year of computer science at Concordia University. I love dancing and could be very addicted to read Chinese novels. I love web application. Right now I am learning and practing developing web application by laravel/homestead, git, wordpress, forge and digital ocean.Now I could confidently automate the process of local test-git version control and server update. Also it’s my first github page powered by Hexo and theme by PPOffice. I guess I would stay here long time and share my experice. Most of important of all, I am learning Active.js which is amazing library.","categories":[],"tags":[{"name":"markdown","slug":"markdown","permalink":"https://baifamonv.github.io/tags/markdown/"}]}]}